--เพิ่มข้อมูลลงในตาราง Employees
Insert Into Employees
	(EmployeeID, FirstName, LastName, TitleOfCourtesy, Title,
	 BrithDate, HireDate, Country, Phone)
Values
	(1, 'Karn', 'Upachai', 'Mr.', 'Menager',
	 '1997-03-11', '2025-10-02', 'Thailnd', '089-999-9867'),
	(2, 'First', 'Rojanathon', 'Mr.', 'Service',
	 '1998-06-3', '2025-10-03', 'Thailnd', '067-667-4567'),
	(3, 'Tevit', 'Kugimiya', 'Mr.', 'Service',
	 '2000-08-11', '2025-10-08', 'Thailnd', '093-225-2567'),
	(4, 'Nancy', 'Jostar', 'Mrs.', 'Service',
	 '1987-08-24', '2025-11-03', 'England', '063-449-4967'),
	(5, 'Muhemmed', 'Porkshop', 'Mr.', 'Service',
	 '1995-03-03', '2025-10-12', 'Egypt', '080-897-0967')


--เพิ่มข้อมูลลงในตาราง Categories
Insert Into Categories
	(CategoryID, CategoryName)
Values
	('001', 'Plastic'),
	('002', 'Metal'),
	('003', 'Paper'),
	('004', 'Glass')


--เพิ่มข้อมูลลงในตาราง Materials
Insert Into Materials
	(MaterialsID, CategoryID, MaterialsName, Unit, CurrentPricePerUnit)
Values
	('001', 1, 'กระดาษลัง', 'กิโลกรัม', 4),
	('002', 2, 'ขวดพลาสติกใส', 'กิโลกรัม', 12),
	('003', 3, 'กระป๋องอลูมิเนียม', 'กิโลกรัม', 35),
	('004', 3, 'เหล็กหนา', 'กิโลกรัม', 8),
	('005', 1, 'กระดาษแผ่น', 'กิโลกรัม', 3),
	('006', 4, 'ขวดแก้ว', 'กิโลกรัม', 2)


--เพิ่มข้อมูลลงในตาราง Sellers
Insert Into Sellers
	(SellerID, SellerName, Phone)
Values
	(1, 'Jimmy', '+44 39-3678-4567'),
	(2, 'Mark Rober', '+44 20-1234-4567'),
	(3, 'คิม ไข่ใหญ่', '067-983-5670'),
	(4, 'ธนภูมิ ประทุมชัย', '093-357-5567'),
	(5, 'Elon Musk', '+44 34-3430-9592'),
	(6, 'ไหมไทย', '080-945-5532'),
	(7, 'เขียว', '099-345-5767')


--เพิ่มข้อมูลลงในตาราง Purchases
Insert Into Purchases
	(PurchaseID, SellerID, EmployeeID, PurchaseDate, TotalAmount)
Values
	(1, 1, 1, '2026-01-01', 150),
	(2, 2, 1, '2026-01-4', 320),
	(3, 3, 2, '2026-01-11', 100),
	(4, 4, 2, '2026-03-05', 470),
	(5, 3, 5, '2026-09-17', 414),
	(6, 7, 3, '2026-09-29', 290),
	(7, 5, 3, '2026-02-02', 55),
	(8, 1, 5, '2026-07-30', 750),
	(9, 1, 2, '2026-04-11', 160),
	(10, 4, 5, '2026-06-28', 80),
	(11, 2, 5, '2026-02-03', 270),
	(12, 6, 2, '2026-03-25', 660),
	(13, 1, 3, '2026-12-28', 449),
	(14, 2, 5, '2026-01-13', 250),
	(15, 6, 3, '2026-01-06', 290),
	(16, 3, 4, '2026-12-16', 450)


--เพิ่มข้อมูลลงในตาราง PurchaseDetails
Insert Into PurchaseDetails
	(PurchaseID, MaterialsID,
	 [Weight], PricePerUnit, SubTotal)
Values
	(1, '003', 2.00, 35, 70),
    (1, '004', 10.00, 8, 80),
    (2, '002', 10.00, 12, 120),
    (2, '004', 25.00, 8, 200),
    (3, '001', 25.00, 4, 100),
    (4, '003', 10.00, 35, 350),
    (4, '002', 10.00, 12, 120),
    (5, '006', 17.00, 2, 34),
    (5, '004', 47.50, 8, 380),
    (6, '002', 10.00, 12, 120),
    (6, '003', 2.00, 35, 70),
    (6, '001', 25.00, 4, 100),
    (7, '003', 1.00, 35, 35),
    (7, '001', 5.00, 4, 20),
    (8, '004', 50.00, 8, 400),
    (8, '003', 10.00, 35, 350),
    (9, '004', 20.00, 8, 160),
    (10, '001', 20.00, 4, 80),
    (11, '003', 6.00, 35, 210),
    (11, '002', 5.00, 12, 60),
    (12, '002', 20.00, 12, 240),
    (12, '003', 12.00, 35, 420),
    (13, '003', 5.00, 35, 175),
    (13, '001', 68.50, 4, 274),
    (14, '002', 10.00, 12, 120),
    (14, '004', 16.25, 8, 130),
    (15, '004', 30.00, 8, 240),
    (15, '001', 12.50, 4, 50),
    (16, '003', 10.00, 35, 350),
    (16, '001', 25.00, 4, 100)